# Core CLI tools
brew "git"
brew "gh"
brew "bat"
brew "fd"
brew "watch"
brew "tmux"
brew "neovim"
brew "fzf"
brew "ripgrep"
brew "the_silver_searcher"
brew "mise"

# Ruby build dependencies
brew "libyaml"
brew "openssl@3"
brew "readline"
brew "autoconf"

# Fonts
cask "font-monaspace-nerd-font"

# Apps
cask "1password-cli"
cask "ghostty"
